HomeWork-3/reports/1.2G/withIndex/wrk2-R1000.txt
Running 5m test @ http://localhost:5000
  8 threads and 500 connections
  Thread calibration: mean lat.: 1724.166ms, rate sampling interval: 7299ms
  Thread calibration: mean lat.: 1699.105ms, rate sampling interval: 7081ms
  Thread calibration: mean lat.: 1760.552ms, rate sampling interval: 7364ms
  Thread calibration: mean lat.: 1747.546ms, rate sampling interval: 6381ms
  Thread calibration: mean lat.: 1696.727ms, rate sampling interval: 7110ms
  Thread calibration: mean lat.: 1748.559ms, rate sampling interval: 7753ms
  Thread calibration: mean lat.: 1632.097ms, rate sampling interval: 7647ms
  Thread calibration: mean lat.: 1750.030ms, rate sampling interval: 7438ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.93m     1.09m    4.24m    58.07%
    Req/Sec    28.43      6.57    47.00     73.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.97m 
 75.000%    2.85m 
 90.000%    3.37m 
 99.000%    3.87m 
 99.900%    4.04m 
 99.990%    4.16m 
 99.999%    4.23m 
100.000%    4.24m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.275     0.000000            1         1.00
   22904.831     0.100000         6699         1.11
   45678.591     0.200000        13394         1.25
   69861.375     0.300000        20089         1.43
   96600.063     0.400000        26787         1.67
  118292.479     0.500000        33474         2.00
  129695.743     0.550000        36821         2.22
  141295.615     0.600000        40167         2.50
  151650.303     0.650000        43540         2.86
  161611.775     0.700000        46884         3.33
  171048.959     0.750000        50209         4.00
  176422.911     0.775000        51900         4.44
  181403.647     0.800000        53561         5.00
  186122.239     0.825000        55224         5.71
  191234.047     0.850000        56939         6.67
  196476.927     0.875000        58594         8.00
  199360.511     0.887500        59433         8.89
  201981.951     0.900000        60267        10.00
  204865.535     0.912500        61105        11.43
  208404.479     0.925000        61918        13.33
  212074.495     0.937500        62787        16.00
  213647.359     0.943750        63175        17.78
  215613.439     0.950000        63618        20.00
  217448.447     0.956250        64008        22.86
  219545.599     0.962500        64434        26.67
  221773.823     0.968750        64846        32.00
  223084.543     0.971875        65080        35.56
  224264.191     0.975000        65274        40.00
  225443.839     0.978125        65481        45.71
  226754.559     0.981250        65694        53.33
  228196.351     0.984375        65895        64.00
  229244.927     0.985938        65996        71.11
  230424.575     0.987500        66110        80.00
  231473.151     0.989062        66214        91.43
  232521.727     0.990625        66321       106.67
  233570.303     0.992188        66414       128.00
  234094.591     0.992969        66472       142.22
  234749.951     0.993750        66524       160.00
  235536.383     0.994531        66578       182.86
  236453.887     0.995313        66628       213.33
  237371.391     0.996094        66675       256.00
  237895.679     0.996484        66705       284.44
  238288.895     0.996875        66727       320.00
  238813.183     0.997266        66753       365.71
  239337.471     0.997656        66781       426.67
  239992.831     0.998047        66808       512.00
  240386.047     0.998242        66822       568.89
  240910.335     0.998437        66837       640.00
  241303.551     0.998633        66847       731.43
  241827.839     0.998828        66860       853.33
  242483.199     0.999023        66873      1024.00
  243007.487     0.999121        66878      1137.78
  244056.063     0.999219        66884      1280.00
  245235.711     0.999316        66892      1462.86
  246808.575     0.999414        66898      1706.67
  247463.935     0.999512        66906      2048.00
  247726.079     0.999561        66907      2275.56
  247988.223     0.999609        66912      2560.00
  248381.439     0.999658        66915      2925.71
  248512.511     0.999707        66917      3413.33
  248905.727     0.999756        66920      4096.00
  249167.871     0.999780        66922      4551.11
  249298.943     0.999805        66924      5120.00
  249430.015     0.999829        66926      5851.43
  249692.159     0.999854        66928      6826.67
  249692.159     0.999878        66928      8192.00
  249823.231     0.999890        66929      9102.22
  249954.303     0.999902        66930     10240.00
  252444.671     0.999915        66931     11702.86
  252706.815     0.999927        66932     13653.33
  252706.815     0.999939        66932     16384.00
  252968.959     0.999945        66933     18204.44
  252968.959     0.999951        66933     20480.00
  253362.175     0.999957        66934     23405.71
  253362.175     0.999963        66934     27306.67
  253362.175     0.999969        66934     32768.00
  253886.463     0.999973        66935     36408.89
  253886.463     0.999976        66935     40960.00
  253886.463     0.999979        66935     46811.43
  253886.463     0.999982        66935     54613.33
  253886.463     0.999985        66935     65536.00
  254410.751     0.999986        66936     72817.78
  254410.751     1.000000        66936          inf
#[Mean    =   115665.568, StdDeviation   =    65289.843]
#[Max     =   254279.680, Total count    =        66936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   33.47ms
 75.000%    2.73s 
 90.000%    7.92s 
 99.000%   17.53s 
 99.900%   26.18s 
 99.990%   30.28s 
 99.999%   30.95s 
100.000%   31.08s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.145     0.000000            1         1.00
       8.303     0.100000         6698         1.11
      11.991     0.200000        13390         1.25
      14.711     0.300000        20092         1.43
      20.367     0.400000        26782         1.67
      33.471     0.500000        33476         2.00
      47.327     0.550000        36820         2.22
      73.855     0.600000        40169         2.50
     156.927     0.650000        43511         2.86
    1110.015     0.700000        46856         3.33
    2729.983     0.750000        50207         4.00
    3602.431     0.775000        51877         4.44
    4489.215     0.800000        53551         5.00
    5398.527     0.825000        55224         5.71
    6279.167     0.850000        56901         6.67
    7122.943     0.875000        58581         8.00
    7512.063     0.887500        59407         8.89
    7921.663     0.900000        60244        10.00
    8339.455     0.912500        61083        11.43
    8822.783     0.925000        61928        13.33
    9461.759     0.937500        62758        16.00
    9871.359     0.943750        63181        17.78
   10428.415     0.950000        63592        20.00
   11132.927     0.956250        64008        22.86
   11984.895     0.962500        64426        26.67
   12886.015     0.968750        64847        32.00
   13418.495     0.971875        65056        35.56
   13975.551     0.975000        65264        40.00
   14532.607     0.978125        65472        45.71
   15138.815     0.981250        65684        53.33
   15843.327     0.984375        65895        64.00
   16228.351     0.985938        65995        71.11
   16670.719     0.987500        66102        80.00
   17203.199     0.989062        66207        91.43
   17793.023     0.990625        66313       106.67
   18481.151     0.992188        66416       128.00
   18841.599     0.992969        66466       142.22
   19398.655     0.993750        66519       160.00
   19955.711     0.994531        66570       182.86
   20643.839     0.995313        66623       213.33
   21512.191     0.996094        66676       256.00
   21970.943     0.996484        66702       284.44
   22511.615     0.996875        66727       320.00
   23150.591     0.997266        66753       365.71
   23625.727     0.997656        66780       426.67
   24166.399     0.998047        66807       512.00
   24412.159     0.998242        66819       568.89
   24838.143     0.998437        66832       640.00
   25280.511     0.998633        66845       731.43
   25722.879     0.998828        66858       853.33
   26198.015     0.999023        66871      1024.00
   26591.231     0.999121        66878      1137.78
   27049.983     0.999219        66884      1280.00
   27459.583     0.999316        66891      1462.86
   27967.487     0.999414        66897      1706.67
   28475.391     0.999512        66904      2048.00
   28606.463     0.999561        66907      2275.56
   28884.991     0.999609        66910      2560.00
   29261.823     0.999658        66914      2925.71
   29474.815     0.999707        66917      3413.33
   29704.191     0.999756        66921      4096.00
   29753.343     0.999780        66922      4551.11
   29802.495     0.999805        66923      5120.00
   29933.567     0.999829        66925      5851.43
   30195.711     0.999854        66927      6826.67
   30228.479     0.999878        66928      8192.00
   30277.631     0.999890        66929      9102.22
   30474.239     0.999902        66930     10240.00
   30507.007     0.999915        66931     11702.86
   30638.079     0.999927        66932     13653.33
   30638.079     0.999939        66932     16384.00
   30670.847     0.999945        66933     18204.44
   30670.847     0.999951        66933     20480.00
   30818.303     0.999957        66934     23405.71
   30818.303     0.999963        66934     27306.67
   30818.303     0.999969        66934     32768.00
   30949.375     0.999973        66935     36408.89
   30949.375     0.999976        66935     40960.00
   30949.375     0.999979        66935     46811.43
   30949.375     0.999982        66935     54613.33
   30949.375     0.999985        66935     65536.00
   31080.447     0.999986        66936     72817.78
   31080.447     1.000000        66936          inf
#[Mean    =     2137.129, StdDeviation   =     4032.182]
#[Max     =    31064.064, Total count    =        66936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  71616 requests in 5.00m, 90.09MB read
  Socket errors: connect 0, read 0, write 0, timeout 2
Requests/sec:    238.64
Transfer/sec:    307.41KB